#### FabricationConfigurationInfo Members

---

|  |
| --- |
| FabricationConfigurationInfo Class   Methods   Properties   See Also |

The  FabricationConfigurationInfo  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FabricationConfigurationInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method Static member | FindSourceFabricationConfiguration | Finds the source fabrication configuration on disk which matches the input fabrication configuration. |
| Public method Static member | GetAllFabricationConfigurations | Gets all added fabrication configurations. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetProfiles | Return the profiles in the fabrication configuration. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsValid | Checks if the fabrication configuration is valid. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CloudId | The identifier of the cloud configuration. |
| Public property | Description | The description of the fabrication configuration. |
| Public property | GUID | The unique identification of the fabrication configuration. |
| Public property | IsCloudConfiguration | Whether the cloud configuration is a remote cloud one. |
| Public property | IsLocked | Checks whether the fabrication configuration is locked. If true, the configuration is locked and cannot be removed. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Name | The name of the fabrication configuration. |
| Public property | Path | The path where the fabrication configuration is located. To populate this property, you may need to call  FindSourceFabricationConfiguration  first. |
| Public property | UnitSystem | The unit system of the fabrication configuration. Units can be UnitSystem.Metric or UnitSystem.Imperial. |
| Public property | Version | The version of the fabrication configuration. |

# See Also

FabricationConfigurationInfo Class

Autodesk.Revit.DB Namespace